---
kind: method
id: M:Autodesk.Revit.DB.CategorySet.GetEnumerator
source: html/4636cad8-9725-d31c-a3b4-5ec3044e0534.htm
---
# Autodesk.Revit.DB.CategorySet.GetEnumerator Method

Retrieve a forward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual IEnumerator GetEnumerator()
```

## Returns
Returns a forward moving iterator to the set.